In [1]:
import pandas as pd

In [2]:
data = {
    'name': ['gokul', 'vatsa', 'chatrapathi'],
    'age': [17, 16, 17],
    'place': ['kadapa', 'kurnool', 'kurnool'],
    'marks': [90, 50, 30],
    'grade': ['A', 'B', 'C'],
}
df = pd.DataFrame(data)
df

          name  age    place  marks grade
0        gokul   17   kadapa     90     A
1        vatsa   16  kurnool     50     B
2  chatrapathi   17  kurnool     30     C

1. Adding columns

In [3]:
df['status'] = ['pass', 'pass', 'fail']
df

          name  age    place  marks grade status
0        gokul   17   kadapa     90     A   pass
1        vatsa   16  kurnool     50     B   pass
2  chatrapathi   17  kurnool     30     C   fail

column based conditions

In [4]:
df['result'] = df['marks'] > 80
df

          name  age    place  marks grade status  result
0        gokul   17   kadapa     90     A   pass    True
1        vatsa   16  kurnool     50     B   pass   False
2  chatrapathi   17  kurnool     30     C   fail   False

updating columns

In [5]:
df['marks'] = df['marks'] + 5 #this updates every value
df

          name  age    place  marks grade status  result
0        gokul   17   kadapa     95     A   pass    True
1        vatsa   16  kurnool     55     B   pass   False
2  chatrapathi   17  kurnool     35     C   fail   False

In [6]:
df.at[0, 'marks'] = 90
df

          name  age    place  marks grade status  result
0        gokul   17   kadapa     90     A   pass    True
1        vatsa   16  kurnool     55     B   pass   False
2  chatrapathi   17  kurnool     35     C   fail   False

deleting columns

In [7]:
del df['result']

In [8]:
df

          name  age    place  marks grade status
0        gokul   17   kadapa     90     A   pass
1        vatsa   16  kurnool     55     B   pass
2  chatrapathi   17  kurnool     35     C   fail

In [9]:
#using drop()
df = df.drop('status', axis=1)
df

          name  age    place  marks grade
0        gokul   17   kadapa     90     A
1        vatsa   16  kurnool     55     B
2  chatrapathi   17  kurnool     35     C